/*
 * Имате предварително въведени стойности от естествени числа,
въведени в квадратна таблица с размери 6 реда и 6 колони.
Да се състави програма , чрез която се намира сумата на всички
елементи, чиято сума на индекси за ред и колона е четно число.
Програмата да извежда формираните суми за всеки отделен ред на
квадратната таблица, както и общата сума от тези елементи.
Да се използва само един цикъл.

Пример:
11,12,13,14,15,16,
21,22,23,24,25,26,
31,32,33,34,35,36,
41,42,43,44,45,46,
51,52,53,54,55,56,
61,62,63,64,65,66
Изход:
11, ,13, ,15, , сума от елементите за реда: 39
22, ,24, ,26, сума от елементите за реда: 72
31, ,33, ,35, , сума от елементите за реда: 99
42, ,44, ,46, сума от елементите за реда: 132
51, ,53, ,55, , сума от елементите за реда: 159
62, ,64, ,66 сума от елементите за реда: 192
Сума на елементите: 693
 * */
public class Task07 {

	public static void main(String[] args) {
		int[][] intMatrix = { { 11, 12, 13, 14, 15, 16 }, { 21, 22, 23, 24, 25, 26 }, { 31, 32, 33, 34, 35, 36 },
				{ 41, 42, 43, 44, 45, 46 }, { 51, 52, 53, 54, 55, 56 }, { 61, 62, 63, 64, 65, 66 } };

		int row = 0;
		int col = 0;
		int maxElement = intMatrix.length - 1;
		int rowSum = 0;
		int allSum = 0;

		for (int elements = 0; elements < intMatrix.length * intMatrix.length; elements++) {

			if ((row + 1 + col + 1) % 2 == 0) {
				System.out.print("[" + intMatrix[row][col] + "]");
				rowSum+=intMatrix[row][col];
			} else {
				System.out.print("[  ]");
			}
			col++;
			if (col > maxElement) {
				col = 0;
				row++;
				System.out.println(" сума от елементите за реда: " + rowSum);
				allSum += rowSum;
				rowSum = 0;
			}
			
			
		}
		
		System.out.println("Сума на елементите: " + allSum);

	}

}
