import java.util.Scanner;

/*Въведено е трицифрено естествено число от вида abc.
Трябва да се провери дали:
ако a = b = c - Изход: цифрите са равни;
ако a>b>c - Изход: цифрите са във възходящ ред;
ако a<b<c цифрите са в низходящ ред;
и изход: цифрите са ненаредени, за неописаните случаи.
Да се състави програма, която извежда резултата от проверката за
наредба на цифрите в числото.
Пример: 345
Изход: възходящ ред.


!!!!! 
НЕТОЧНО УСЛОВИЕ НА ЗАДАЧАТА
Ако вземем примера abc = 345 то a = 3, b = 4, c = 5 което е 3<4<5 = a<b<c. За тази подредба отговора, 
който се иска е "цифрите са в низходящ ред".


*/

public class Task16 {

	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);

		System.out.print("Въведете тричифрено число: ");
		int abc = sc.nextInt();

		int c = abc % 10;
		int b = (abc / 10) % 10;
		int a = (abc / 100) % 10;

		if (a == b && b == c) {
			System.out.println("Цифрите са равни.");
		} else if (a < b && b < c) {
			System.out.println("Цифрите са в низходящ ред.");

		} else if (a > b && b > c) {
			System.out.println("Цифрите са във възходящ ред.");

		} else {
			System.out.println("Цифрите са ненаредени, за неописаните случаи.");
		}

	}

}
